Revit 2027 API
HardwoodTintEnabledType Enumeration
 The enumerated type representing the permitted values for the asset property "HardwoodTintEnabled" from the "Hardwood" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum HardwoodTintEnabledType
Public Enumeration HardwoodTintEnabledType
public enum class HardwoodTintEnabledType
type HardwoodTintEnabledType
Members
Member name | Value | Description
ColorChoice | 1
NoColor | 0
See Also
Reference
Autodesk.Revit.DB.Visual Namespace